// ==================[ About Image ]================== //
export const achievements = [
  "🚀 Выполнено более 245 проектов",
  "💡 Опыт работы более 15 лет в IT",
  "😊 Более 230 довольных клиентов и партнеров",
  "✅ Гибкие модели сотрудничества",
  "🌍 Работаем с клиентами по всему миру",
];
//

// ==================[ About Image ]================== //
export const about_image = "/images/about.jpg";
//

// ==================[ Are you available for hire? ]================== //
export const is_available = true; // true if you are, otherwise false
//

// ==================[ Cv File ]================== //
export const cv = {
  source: "/cv.pdf", // if you don't have just leave source: ""
  file_type: "pdf",
};
//

// ==================[ What I Use or Tools ]================== //
export const tools = [
  // 1
  {
    name: "typescript",
    image: "/images/tools/ts.png",
    color: "blue",
  },

  // 2
  {
    name: "react",
    image: "/images/tools/react.png",
    color: "blue",
  },

  // 3
  {
    name: "nestjs",
    image: "/images/tools/nestjs.png",
    color: "red",
  },

  // 4
  {
    name: "graphql",
    image: "/images/tools/graphql.png",
    color: "pink",
  },

  // 5
  {
    name: "nextjs",
    image: "/images/tools/nextjs.png",
    color: "black",
  },

  // 6
  {
    name: "sql",
    image: "/images/tools/sql.png",
    color: "blue",
  },

  // 7
  {
    name: "laravel",
    image: "/images/tools/laravel.png",
    color: "red",
  },

  // 8
  {
    name: "docker",
    image: "/images/tools/docker.png",
    color: "blue",
  },
] as const;
//

// ==================[ Skills ]================== //
export const skills = [
  // 1
  {
    skill: "Full-Cycle Разработка",
    progress: 95,
  },

  // 2
  {
    skill: "Качество и оптимизация кода",
    progress: 90,
  },

  // 3
  {
    skill: "Решение сложных бизнес-задач",
    progress: 88,
  },

  // 4
  {
    skill: "Управление проектами",
    progress: 89,
  },

  // 5
  {
    skill: "Коммуникация и отчетность",
    progress: 92,
  },
] as const;
//

// ==================[ Languages ]================== //
export const languages = [
  // 1
  {
    language: "English",
    progress: 96,
  },

  // 2
  {
    language: "Русский",
    progress: 100,
  },

  // 3
  {
    language: "Немецкий",
    progress: 75,
  },

  // 4
  {
    language: "Arab",
    progress: 35,
  },
] as const;
//

// ==================[ What's Client says ]================== //
export const clients = [
  // 1
  {
    name: "Евгений Борисов , CEO IT-компании 'Альфа'",
    image: "/images/clients/1.jpg",
    rate: 5,
    comment:
      "Ребята из Apsod сделали для нас сложный FinTech продукт. Сработали как полноценная часть нашей команды, проявили высокую экспертизу.",
  },

  // 2
  {
    name: "Мария Яшина,руководитель проекта в 'БетаМаркет'",
    image: "/images/clients/2.jpg",
    rate: 4.5,
    comment:
      "Мы получили именно то, что хотели — удобный и современный сайт, который уже приносит лиды. Процесс был организован четко.",
  },

  // 3
  {
    name: "Алексей Смирнов,основатель стартапа 'Innova'",
    image: "/images/clients/3.jpg",
    rate: 5,
    comment:
      "Спасибо за терпение и проффесионализм. Помогли нам не только с разработкой, но и с архитектурой проекта на старте. Настоящие партнеры.",
  },
] as const;
//

// ==================[ Goals ]================== //
export const goals = [
  // 1
  {
    goal: "Создавать digital-продукты высшего качества 💎",
    description:
      "Мы фокусируемся на качестве кода, масштабируемости и производительности наших решений, чтобы они служили годами.",
  },

  // 2
  {
    goal: "Стать надежным партнером, а не просто подрядчиком  🤝",
    description:
      " Мы глубоко погружаемся в бизнес-задачи наших клиентов, чтобы предлагать решения, которые действительно работают и приносят результат.",
  },

  // 3
  {
    goal: "Браться за самые амбициозные вызовы 💪🏽",
    description:
      "Нас вдохновляют сложные и инновационные проекты, которые позволяют нам расти и двигать вперед всю индустрию.",
  },

  // 4
  {
    goal: "Делиться опытом и развивать комьюнити ✅",
    description:
      "Мы верим в открытость знаний, участвуем в конференциях и развиваем среду IT в нашем регионе.",
  },
] as const;
//
