// ==================[ Process ]================== //
export const process = [
  // 1
  {
    event: "1. Аудит и погружение",
    year: "Погружаемся в ваш бизнес",
    description:
      "Внимательно изучаем ваши цели, аудиторию и конкурентов. Проводим технический аудит (если есть существующий проект). Формируем детальное техническое задание и план работы, чтобы решение было идеальным для вас.",
    icon: "💬",
  },

  // 2
  {
    event: "2. Прототип и дизайн",
    year: "Создаём визуальную концепцию",
    description:
      "Разрабатываем интуитивно понятные прототипы будущего продукта, чтобы вы сразу увидели логику и структуру. Утверждаем каждый элемент. Создаём современный и запоминающийся дизайн, который усиливает ваш бренд и нравится вашим клиентам.",
    icon: "🎨",
  },

  // 3
  {
    event: "3. Разработка и интеграция",
    year: "Строим надежный фундамент",
    description:
      "Пишем чистый, структурированный и масштабируемый код. Внедряем все необходимые инструменты: подключаем платёжные системы, CRM, телефонию и другие сервисы. Проводим постоянное тестирование, чтобы всё работало безупречно.",
    icon: "💻",
  },

  // 4
  {
    event: "4. Запуск и рост",
    year: "Запускаем и поддерживаем",
    description:
      "Обеспечиваем плавный и надежный запуск проекта. Не бросаем вас после сдачи работы: предлагаем услуги постоянной технической поддержки, мониторинга и развития. Помогаем масштабировать решение под растущие задачи вашего бизнеса.",
    icon: "🚀",
  },
] as const;
